{"pages":[],"posts":[{"title":"Kiwi!","text":"视频链接：KiWi! KIWI是一只无翼的小鸟，从小就有一个飞翔的梦想。为了实现自己毕生的“飞行”梦想而费劲千辛万苦将一棵棵树水平的钉在了陡峭的悬崖上，直延伸至山谷的最底部。就在最后一棵树被KIWI牢固的钉在峭壁上后，KIWI的准备工作全部结束了，它即将实现它的梦想——飞行。KIWI显得有些兴奋，它用掌声为自己鼓励加油，为了这次飞行它甚至还准备了飞行帽。 从山巅到绝谷，这是一次必死的飞行，为了飞行之梦KIWI显得从容而坚定。 一个漂亮的鱼跃后，KIWI一生中最辉煌的时刻在飞行中度过了，但这也是它最后的辉煌。风在耳边呼啸而过，KIWI的眼里悬崖成了地平线。令人激动的飞翔，白云在身边飘过，身下树木郁郁葱葱。KIWI努力的扇着自己那小的几乎毫无作用的翅膀，想像着自己是一只健康的小鸟，无拘无束地遨游在蓝天之下，那是它一生的梦想。KIWI眼角溢出了一滴泪水，混合着所有的酸甜苦辣。那是为梦想得以实现而泣,是为自己的命运而泣,是为那瞬间的幸福满足而泣,是为眷恋这即将离开的世界而泣。 世上什么最可贵？只有一次的生命最可贵，失去了永远不会再来。KIWI为了一生唯一的一次飞行梦想而义无反顾地付出生命，我们又有什么理由不去为自己的梦想而奋斗，至少我们还用不着为此而付出生命的代价。","link":"/2013/08/05/Kiwi/"},{"title":"MapReduce和YARN的区别和联系[转]","text":"初学Hadoop，多多学习 :) 本文转载自MapReduce和YARN的区别和联系 Hadoop 的最常见用法之一是 Web 搜索。虽然它不是唯一的软件框架应用程序，但作为一个并行数据处理引擎，它的表现非常突出。Hadoop 最有趣的方面之一是 Map and Reduce 流程，它受到Google开发的启发。这个流程称为创建索引，它将 Web爬行器检索到的文本 Web 页面作为输入，并且将这些页面上的单词的频率报告作为结果。然后可以在整个 Web 搜索过程中使用这个结果从已定义的搜索参数中识别内容。 MapReduce最简单的 MapReduce应用程序至少包含 3 个部分：一个 Map 函数、一个 Reduce 函数和一个 main 函数。main 函数将作业控制和文件输入/输出结合起来。在这点上，Hadoop 提供了大量的接口和抽象类，从而为 Hadoop应用程序开发人员提供许多工具，可用于调试和性能度量等。 MapReduce 本身就是用于并行处理大数据集的软件框架。MapReduce 的根源是函数性编程中的 map 和 reduce 函数。它由两个可能包含有许多实例（许多 Map 和 Reduce）的操作组成。Map 函数接受一组数据并将其转换为一个键/值对列表，输入域中的每个元素对应一个键/值对。Reduce 函数接受 Map 函数生成的列表，然后根据它们的键（为每个键生成一个键/值对）缩小键/值对列表。 这里提供一个示例，帮助您理解它。假设输入域是 one small step for man,one giant leap for mankind。在这个域上运行 Map 函数将得出以下的键/值对列表： （one,1） (small,1） (step,1） (for,1） (man,1） (one,1） (giant,1） (leap,1） (for,1） (mankind,1） 如果对这个键/值对列表应用 Reduce 函数，将得到以下一组键/值对： （one,2） (small,1） (step,1） (for,2） (man,1）（giant,1） (leap,1） (mankind,1） 结果是对输入域中的单词进行计数，这无疑对处理索引十分有用。但是，假设有两个输入域，第一个是 one small step for man，第二个是 one giant leap for mankind。您可以在每个域上执行 Map 函数和 Reduce 函数，然后将这两个键/值对列表应用到另一个 Reduce 函数，这时得到与前面一样的结果。换句话说，可以在输入域并行使用相同的操作，得到的结果是一样的，但速度更快。这便是 MapReduce 的威力；它的并行功能可在任意数量的系统上使用。 Hadoop它是如何实现这个功能的？一个代表客户机在单个主系统上启动的 MapReduce应用程序称为 JobTracker。类似于 NameNode，它是 Hadoop 集群中惟一负责控制 MapReduce应用程序的系统。在应用程序提交之后，将提供包含在 HDFS 中的输入和输出目录。JobTracker 使用文件块信息（物理量和位置）确定如何创建其他 TaskTracker 从属任务。MapReduce应用程序被复制到每个出现输入文件块的节点。将为特定节点上的每个文件块创建一个惟一的从属任务。每个 TaskTracker 将状态和完成信息报告给 JobTracker。 Hadoop 的这个特点非常重要，因为它并没有将存储移动到某个位置以供处理，而是将处理移动到存储。这通过根据集群中的节点数调节处理，因此支持高效的数据处理。 Hadoop是一种分布式数据和计算的框架。它很擅长存储大量的半结构化的数据集。数据可以随机存放，所以一个磁盘的失败并不会带来数据丢失。Hadoop也非常擅长分布式计算——快速地跨多台机器处理大型数据集合。 MapReduce是处理大量半结构化数据集合的编程模型。编程模型是一种处理并结构化特定问题的方式。例如，在一个关系数据库中，使用一种集合语言执行查询，如SQL。告诉语言想要的结果，并将它提交给系统来计算出如何产生计算。还可以用更传统的语言(C++，Java)，一步步地来解决问题。这是两种不同的编程模型，MapReduce就是另外一种。 MapReduce和Hadoop是相互独立的，实际上又能相互配合工作得很好。","link":"/2019/03/01/MapReduce和YARN的区别和联系-转/"},{"title":"Pig的一些基础概念及用法总结[转]","text":"文章较长，查看原文Apache Pig的一些基础概念及用法总结了解更多细节","link":"/2019/02/20/Pig的一些基础概念及用法总结-转/"},{"title":"关于爱国","text":"高中语文老师告诉我们，做人要常常心怀社会，学会思考和感悟，有自己的原则和思想，不要被生活的琐事局限了视野。 好不容易看到个有价值、值得每个人去看的正能量文章。文章通过阐述历史意欲唤起中华民族对自身文化的认同感。鞭辟入里、振聋发聩，真切地反映了现代中国人缺少的宝贵精神品质。突然有种热血想分享给大家看。 鬼使神差，不由自主将它分享到了群里。期待同学们能思索和感悟，将正能量的东西留在心中，对社会有重新的审视，对现实做出反思与改变。希望宝贵的思想品质丰富我们的大学精神。 可是我收到的却是这些回应：“过去的事情咱也没经历过，谁也不知道什么是对的。而且过去的事关我们啥事。”，“我可以说这篇文章宣扬民族对立吗”，“地摊文章还是少看好”。 凡是具有民族精神爱国精神的片段一律忽略，喷子热衷于从细枝末节排除异己。 文章里提到：“欲灭其国，先去其史。”说的很对，中国还有多少人感慨于历史先辈的铁骨铮铮。冉闵，力挽狂澜，拯救华夏于危亡之际；陶渊明，不为五斗米折腰；李白，安能摧眉折腰事权贵；虞允文，国难当头，挺身而出；文天祥，人生自古谁无死，留取丹心照汗青。这些历史关我们什么事。 揭露满清统治者的罪行，更正被人们误解的明清历史，这也能联想到宣扬民族对立？什么是地摊文章，地摊文章都是垃圾都是糟粕，对我的学习对我的工作一点帮助也没有。那些思想都是没有意义的，写爱国爱民族都是偏激的，爱国能让我过得更好？那些对文章对思想的热血沸腾还是少些为好，不然会显得你很幼稚。 来吧，像我一样，冷漠起来。 嗯，大学生。在思想最自由最开放的时期，拒绝爱国主义、漠视民族情怀，追逐高薪追逐权力，对国家的局势坐视不管。法国遭遇恐怖袭击，中国的同情被外国媒体所曲解，我们在寝室里打着游戏没空搭理；当外文媒体称中国挑起南海争端，大大小小的国家和地区（包括台湾）与中国对立的时候，我们在诙谐地刷着美国队长和九头蛇的故事。 真正等我们发言的时候，时事早已在网上传得沸沸扬扬，夹着不知道什么目的的言论，夹着鱼龙混杂的说法，信奉一言之词，不去想想是非因果，只知道跟着群众附和蔡英文下台，只知道附和围攻广电总局，只知道责难高考的减招。 是的，执政党给我们灌输了太多的爱国教育，以至于我们对爱国思想民族情怀产生抵触情绪。学着彼此指责执政党的不是，跟风发表言论，不指责好像不能显示自己有多么新颖独到的政治思想。如果你爱执政党，那么你就是异类。自己不行，却认为祖先和文化有问题，漠视先辈灿烂的文化和辉煌的文明。 嗯，你觉得公然抒发爱国之情很傻很愚昧，你看透了国家方方面面的黑暗；你觉得没事去对时事新闻发表自己的言论很怪异，不如在空间动态给我点个赞；你觉得没事拿一篇有价值的文章来分享很反人类，你怎么不拿点好吃的孝敬爸爸我。 上厕所不冲水、汤汁饮料尽管往垃圾桶里倒、抽水马桶不停放水，关我什么事。北京上海就是有优越感，我就是不爽。等将来有出息了，要去美国、去新加坡，顺便再把国籍也迁走。我将来要当大官，那里捞的钱比较多。大学生，超越全国大部分群体享受高等教育，结果出来的是没有社会责任感、没有民族认同感、没有爱国情怀的行尸走肉。 诶，兄弟，装什么逼啊。 我曾经看到过一幅漫画，一个有思想的人来到全新的集体。他很希望跟别人分享自己有价值的想法，可是没人愿意搭理他。渐渐地，为了适应这个集体，他也开始变得沉默寡言，故作深沉。最终，人群中再也找不到他的身影。 但，我不是他。","link":"/2016/06/14/关于爱国/"},{"title":"南方的雨","text":"我一直很喜欢下雨天。喜欢下狂风暴雨，听狂风呼啸夹杂着从远方传来的密集而爆裂的雨声，也喜欢听厚重阴云下的一声雷鸣，倏然响彻天宇，震耳欲聋，让亮到发红的闪电点亮整个夜晚。那种自然而原始的野性，从远方迸发出来，在我的心里咆哮、呐喊。 将下雨而未下的天空，是最令人神往的。印象最深的一次是小学放学回家，下午四五点钟的天空瞬间被巨大的乌云笼罩，然后天空瞬间从白天变为黑夜。小小的我背着书包，刚好从偌大的广场经过，使劲抬头望着无边无际的乌云，看着街上的车陆续点亮车灯，跟随着快意的凉风一边走一边肆意转圈。那种新奇而又沁人心脾的感觉，在我心里埋下一颗深深的种子。记得有一年台风到来的时候，我兴奋地撑上伞提着桶去小区里接雨。兴冲冲跑出馨庭居的门，在伞下看着桶被雨淋得滴答作响，对着地面上密集的涟漪发呆。南方的树多，下雨天的四周绿得鲜艳而发油，各种树香草香弥漫开来，让人不由自主地想多吸几口。这些都是小时候的美好回忆了。 雨对于我的记忆也是复杂的。十多年前的深圳，台风过后经常会有内涝。差不多在幼儿园的时候，一次台风过后，院子外的积水漫上了门口，预计能漫过一个成年人的膝盖。那时候很期待能出去蹚一蹚这个浑水，可惜因为危险，大家都不让我出去玩。我于是叠了很多纸船让他们飘在屋外的水面上，期待明年、后年什么时候能再来一次。可惜一直到长大，也没能等到一趟与我有缘的内涝，感受这期待已久的乐趣了。 我还记得小时候下暴雨的时候坐公交坐过站，就急忙在南头检查站下车，去等另一班回家的公交。此时熙攘的人群已经填满了站台，我当时没有带伞，站在站台雨棚外面会淋湿，挤进人群又看不清是哪一路公交车。一位好心的阿姨看我在雨中失措落魄的样子，给我撑伞避雨。尽管当时已经浑身湿透，但还是特别感谢那位好心人。回到家后老爸看我浑身湿透把我骂了一顿，说我蠢成这样，不懂得向陌生人借电话。现在回忆起当时的心情，依旧是很委屈和难过。是呀，我可能是得多淋几次雨，才能拥有一个聪明的脑瓜吧。 相比华南，华东的雨偏为细腻。春天时，上海的淫雨从天空中温柔地飘落到身上，再随着时间慢慢地化开。这种雨适合让人撑起一把油纸伞，独自彷徨在悠长又寂寥的雨巷。伴随着初春的薄雾，确实诗意盎然。可是心里一直向往的，依旧是华南粗犷豪放的雨。 最近三十年来最强的台风“山竹”光临广东，我其实挺遗憾没能亲临现场的。但是这次的感觉却与之前截然不同。看到爸妈发来的照片，熟悉的道路被树堵死，街道变成了凌乱的丛林。广东成为新闻关注的焦点，成片的榕树连根拔地而起，横倒在路中间，砸扁难以计数的车辆。居民的窗户被吹碎，车辆陷入隧道泡了一夜。人们爬树上班，地铁站的人群排起了长龙，没有被挡的道路也开始变得拥堵。老妈在阳台种的辣椒让她天天得意有盼头，一晚上之间也全部没了。整座城市一片狼藉，整座城里的人们心都在一根弦上，眼眶竟有点湿润。生命、城市在大自然下依旧渺小，无论何时，都需要一颗敬畏自然的心。 雨天承载着一个南方人说不完道不尽的回忆。阵雨淅淅沥沥拍打着仙湖的灌木森林，树丛不断摇摆形成山间的浪潮，雨水顺着山路所向披靡，峡谷间的湖泊在雨间升起缕缕轻烟，弥漫在甘甜的空气中。记忆中的画面仿佛在说：雨的洒脱，风的爽朗，是南方的魂。","link":"/2018/09/18/南方的雨/"},{"title":"我游离的归属感","text":"每到周末，从忙碌的学校挣脱出来，一个人呆在爸爸妈妈都去上班的空屋子里，我的内心总是空荡荡的，似乎少了些什么，但是又好像无法弥补。 还没有回味完早上的阳光，在恍惚间黄昏已在跟我招手。看着床上堆得成山的作业，我的心情有些失落，或者说是很糟糕，觉得自己不是一般的颓废，真是越大越不如从前了。我看了看电脑右下角的时间，才恍然现在已经是2013年了，这个数字安在我的身边，很陌生、很畏惧，但是又不得不面对。 也不知道为什么，在我的印象中，去年才刚刚汶川地震，北京举办完奥运会，过了几个月完成了世博，然后是大运会我们的庆祝，这些好像离我都没有远去，可是数数已经过了四五个年头，我来到世上三分之一的时光。 呵呵，刚刚痛哭流涕告别小学，现在初中的同学已经分离。虽然留了小学同学们的联系方式，可是这又有什么用呢，我们的隔膜已经很深很深了，好像再也找不到能够搭讪的理由。我知道，就算我们聊了起来，小学的记忆便被陌生的成熟的言语抹去，相见不如不见！ 回家的地铁站内遇到满满，我们在人群中多了那么一瞥，就这样尴尬地聊了几句就分别了，我不知道这是不是我人生中最后一次跟她的相遇。杨欣在QQ中跟我聊天，我才知道小学时她来我家碰到了的邻居邹涵今天是她的同班同学，我们当初又如何会想到这些！我们聊了一些近况，问了问她和嘎杂张瑞宗的班级，以一如既往的形式调侃了几句。知道了杨欣是语文课代表，张瑞宗在高一三班。可是这又能怎么样，我们终究不能回到过去。 爸爸妈妈南下闯荡的将近二十年中，我们已经在深圳六所房子里留下过生活的印记。对于爸爸妈妈来说，爷爷家和外公家是他们永恒的根；对于我这个跟父母生活在一起的人来说，我的根没有落脚点。 今年春节，我们从馨庭居搬走，来到凯旋城。馨庭居的余韵还留着：我记得胖子保安陪我从小玩到大，记得和家人邻居在花园里打羽毛球，记得爸爸跟方叔叔的聊天，记得和妈妈一起每天晚上吊单杠，记得早上响起的幼儿园清丽的歌声……我对这儿的记忆太多太多，可是此去经年终将被时光遗忘。告别了僻静的社区，我来到一个完全陌生的环境中，很忐忑，很想回去，可是旧房子已经租给别人，我发现我已经回不去那个地方了，我回不去了。 与初中部揖别，我来到仅一路之隔的高中部。高中生活还很崭新，但是已经非常熟悉，就像一个在宝中百般历练经验丰富的老者一样。从窗外总能望到我们曾经哭过笑过的地方，可是一切都变得可望不可即。我能看到原来屹立在三楼的七村，看到新修的运动场，看到曾经中午期待的饭堂，看到巍峨的湛蓝天亭，可是我看到初中部的围墙变得很高很高。 我知道我的恩师们正在以同样的心血去哺育后来者，我也知道我已经回不去那个地方了，我回不去了。 我还记得初中的时候，曾心妍跟我说高中的人很有心计，让我提防一些。今天我意识到高中没有想象的那么勾心斗角恐怖至极，只是有些人们的友谊之间多了很多与利益相关的东西，这样的友谊是虚伪空洞的，不像初中的那么真、那么纯。 不过高中生活里还是存在真情的。和宿友在月光下奋斗，调侃生活琐事，建立抗击宿管统一战线；和同僚互相尊重而谦让，小事中诚意如花；和挚友一起踏着夕阳回家，一路浩荡行进，驰骋云端；和死党勾肩搭背，互相激励成长。妈妈的爱化作短信的文字夜夜飘进我的梦乡，爸爸的问候充满着对我的期待与鼓励。有时候发现自己原来很幸福，我的心灵皈依到这浓浓情感上来了。 真的是逝者不舍昼夜啊，我们所共同拥有的时间就像浩浩江水滚滚远去。我们被水流冲向远方，不知道出发点在哪里、目的地在何处。看着河岸美丽的风景，想留下来，可是河流终究无情流走，带我们来到未知的前方。 有时候觉得好累，我们一天天成长，又一天天老去，为很多事情欣喜过、悲伤过，可是什么都只属于我的过去，再也找不出来了。我想在河流中找块石头倚傍，靠着它歇一歇，感觉漂得太快了，可是我发现我停不下来，身旁只有湍急的波澜。 在时间的洪流中，只有你们在，嬗变才是永恒。我们无依无靠，但期待能够携手同行。","link":"/2013/03/24/我游离的归属感/"},{"title":"星空杂想","text":"经常能够在电视上面看到有关宇宙星空之类的纪录片，经常入神于深邃而又飘渺的宇宙空间，看苍穹繁星点点，地球的蓝色光辉在太阳系中显得格外耀眼。 这是一颗拥有生命的星球，蓝色的海洋哺育了一代又一代的奇特物种。今日，人类作为蓝色星球的主宰者在翘首而观，在点点繁星中迷蒙了方向。 发展与利益相对于地球乃至宇宙的诞生，人类的出现是及其短暂的，人类又是何其得渺小。但是人类却已经征服了自然，在这颗蓝色星球上创造了无尽的文明。 文明，是厚重而悠远的。曾经多少文明的积淀如今却寥寥无几，留下的只是青铜器上几个刻画符号罢了，但是现今的人类依然能够从这些文物中感觉得到远古文明的深重影响。新石器时代以来，人类间出现了金钱的交易，古往今来，世世代代的祖先正是凭借金钱与利益发展而来。因为利益人们的技术开始迅速发展繁荣，因为利益人类文明才会有社会性质的改变。经过几千年的金钱交易，人们的财富梦想变质了。之前利益是发展的工具，现在发展却是利益的工具。要知道，一个人类文明存在的最终目的不是为了发展而是追求利益的满足，那么这个文明将不再会闪光。 文明的消失地球经历了种种时代的嬗变：三叶虫繁盛过，陨石一撞击便荡然无存；恐龙称霸过，同样性质的陨石一来也消失殆尽。今天轮到人类面对着这样的问题。我们是怎么知道这些亘古出现的物种的？因为它们留下了化石。 世事没有绝对，地球出现过就一定会消失，这只不过是时间的问题。那么地球消失后的外星生物一定不知道：在这个消逝了的蓝色星球中曾经出现了怎样繁华的人类文明！我们现在在幸福地过日子，等到地球消失的那一瞬间就什么也没有了，我们何曾想过留下文明的印记？人总归是要逝世的，看就看你能不能在人们的心中活得更久。如果后人将你的事迹广为传颂，激励了一代又一代后人，那么你的这一生就没有枉活。那么上天为什么要让人出世呢，因为你肩负着历史的重任，你要推动这个世界的发展。而一个文明的进步正是通过从古到今无数人民的贡献搭就的。 如果拥有这种为人类发展而做出贡献的精神，即使预言中的2012是真实的，那又如何呢？我们可以骄傲地告诉后来居住在这个星球中的人：你们的祖先好样的！ 明亮的夜晚我曾经做过一个梦。小时候，我梦见睡梦中的我忽然被喧闹的汽笛声惊醒，抬头观天，午夜的天空如白昼一样光亮。我欣喜地张开手臂，拥抱洁白的苍穹，旋转，在明亮中眩晕陶醉。 今夜，我抬头而望，头顶上的天空已经亮如白昼，远处与人类灯光的对比之中才黯然失色。我不希望将来的那么一天，我们只有白天而没有夜晚，只有红灯绿酒没有酣然醉梦。城市里的星星不再成片，只有一两颗零碎地点缀天空，傍着月亮唱着原始的摇篮曲。 从太空来看，夜晚的陆地是璀璨的。人类在这片沃土上创造了何其的光芒啊，从一点微弱的火花到世界的光辉，你们带给地球的是怎样的伤痕？ 宇宙中的点点繁星不语，看着这颗发展中的蓝色星球默默惆怅。","link":"/2012/02/09/星空杂想/"},{"title":"朦胧中秋夜","text":"好久没写篇像样的日志了！我在初中的很长一段时间基本上没有时间写这种东西，所以那些零星的琐事自然也不会放进空间。除非是那些堆积在心里实在是憋不住了才会写下来，所以其中通常缺乏一些平常的生活情趣。好不容易有个作业很少让我很激动的假期，我就冲破桎梏写写琐碎的流水账吧。 爸爸回到老家了。暮色四合，我和老妈晃晃悠悠地到舅妈家蹭饭，顺便看看学会了整数和为100以内加减法的鄙弟。宝安大道又一次挂上了耀眼的国旗，印象中跟去年的国庆好像之隔两个多星期而已。在他们家吃完饭后便堆在电视机前看《喜羊羊与灰太狼》，在家里好像总是搜不到喜羊羊的频道。紧接着出现了传说中的《黑猫警长》甚至是《葫芦兄弟》。鄙弟突然从后面伸出一只大脚来搭在我肩上，不知不觉便在我上面坐了上来。妈妈和舅妈便聊着那神奇的100以内算数法，手中不停比划着鄙弟幼儿园教的手指决。 天色已晚，回程的公交车灯昏暗。我透过窗户看着头顶的月亮又大又圆，有点沉醉。猛然想起什么，便叫老妈拨个老爸电话。“老爸，在干吗，中秋节快乐！”爸爸这时正准备上楼睡觉。农村爷爷家的双层小房子我一般都是冬天时才跟它见面的，脑子里瞬间想起了门前月光下的柚子树、想起晚上没灯我害怕叫老爸不停发出声音让我听到我才敢上楼、想起爷爷灶房的薪火四溅、想起我穿着大棉袄看着春晚趴在老妈怀里睡着了的情景…… 车停了，我和妈妈跳下车门，随即走上宝安大道的那座无顶天桥。曾经总是抱怨这座天桥怎么没个遮阳顶，今天反倒让我庆幸了。天桥下橘黄的路灯照亮着目的地的旅途，头上明亮圆润的月照亮着我们时光的航程。“哇！”天空中出现了忽明忽暗的火光，是孔明灯吧。我和妈妈便在天桥上驻足，等待着孔明灯消失在遥远的空中，我们欣喜地许愿。孔明灯在正东方向的珠江口便隐隐下降了，直至熄灭我们看不到了为止。我们看着带有光晕的月亮，发现这个月亮带着耳朵，莫非是“月珥”？妈妈说月亮像个小男孩的侧脸，我怎么看都不像啊，可是她却一意坚持。 我都无法面对花园的保安了：在我们花园张灯结彩挂上红灯笼的时候，他们却在保安亭守着监控录像遐思。我不敢在他们面前把自己表现地很快乐，因为我们的快乐会加剧他们的思念，便热情地打了个招呼：“节日快乐。”现在的天空基本上没有颗像样的星星了，在我年轻的时候还有一两颗点缀。妈妈突然指着天空叫我看，我看到了一个畏畏缩缩的星星朝着我勉强地笑。妈妈还看到几颗我都看不见的星星，我却并没有看到。她担心我的眼睛变近视，我便调侃道：“一般电视里精神病人都会看到正常人看不到的东西，还一个劲说：‘那里，就在那里’，正常人还会附和着：‘好好好，有的’”妈妈于是笑出了声，然后就装作生气地责怪我。 回家上了QQ，外面响着所谓《十五的月亮》的歌，这可是陪了我十几年的经典啊。我几乎跟每个孩子发了个“节日快乐！”从而揪出几个潜水很深的娃，探寻到正在煲电视粥的，发现有在KTV还问我来不来的，找到一个总是对我发哭脸问他怎么了竟然说他耍我的。粘贴“节日快乐！”贴到我手都抽筋，然后招来一大群回复，我基本上都会回个呲牙表情。而且最让我吃惊的是，孩子们的回复大多是异口同声出现“同乐”这个短语，让我不禁汗颜。发祝福，自己的心也热烘烘的。 这个夜晚虽然没有吃到月饼，但是我觉得比以往还要满足，因为我今夜感受到的爱是朦胧的。月亮这个东西只是个陪衬，月饼这个东西只是个形式，重要的是在中秋夜有着暖暖的爱意，这才有意义。","link":"/2012/09/30/朦胧中秋夜/"},{"title":"第一次自由之行","text":"2015年9月19日，我大学生活的第一个周末，新生军训方才结束，正式课程还没有开始，一整天的时间空在那里，等待我去发掘。 因为对城市生活早已厌倦，顺着直觉，我一路向北，远离市区，往城市的边缘走，去看长江，去看海。滨江公园确实很美，湛蓝的天空下，一条路把我引入花与树的世界，五彩斑斓的风筝争相升起，地上铺满了交错纵横的树影，鲜花的芬芳顺风盘旋，小溪的粼粼波纹四散着耀眼的光芒。天空，太阳，鲜花，大树与我一见如故，我的心不自觉升起莫名的感动。 感动，我当然会感动，我当然应该意识到这是我人生的第一次，第一次进入自由。第一次真正离开家人去独自掌握自己的生活，第一次告别束缚顺着自己的心去探索，第一次没有烦恼、用一颗空灵的内心去感知这个我生活了17年的世界。我该是何其感激。我用手机放着我认为世界上最动听最扣人心弦的轻音乐，用最为舒缓的步伐走在柔软的草坪上，全身放松躺在波光粼粼的小河边，看头顶的大树筛下并不刺眼的阳光，静静地看着河边的芦苇随风摇摆。看着摄影爱好者举着相机对着自己的新作品流露满意的笑容，看着一家人哄着婴儿车里的孩子欣喜万分，看着公园草坪上的孩子一起奔跑身后留下串串七彩的泡泡。今天，我不必去担忧我还有作业没有写完，不必去在意我的成绩离我的目标还很遥远，不必去跟同学去比较分数的高低，不必去为家人的身体与和睦而烦恼，也尚不必去担心我的薪资我的生活我的未来。这时候只有我一个人，我一个人躺在公园的草坪，我一个人走在高大而神圣的树林中，用我的手机去记录这些催人泪下的美丽场景。 在美丽的树林里迷路，看到远处的木屋在召唤着我，我顺着一条笔直的长路走到了江边。我听见江边的人群在呼喊在拍照，闻到了沾有水汽的风的味道，看着蓝天下轮船缓缓移动，然后消失在我的视线中。远处的白色风车慢慢地旋转，另一头的灯塔静静屹立在水面中央，海浪扑打着岸边，海鸥划过天空，逍遥地一去不回，自在地不留痕迹。 自由的浪漫与无穷魅力，是我自记事以来不断追求的东西，而今是我真正意义上的第一次，说它是里程碑，一点都不过分。让我成为自由的使者，在我的青春里活得干脆潇洒，就像那些风筝，像那些柳枝，像那些波光，像那些海鸥。像风一样自由，我的青春也要一往无前，活出真正想见到的自己。","link":"/2015/09/19/第一次自由之行/"},{"title":"那些与夜晚的交谈","text":"半夜睡不着，突然想起很多宝贵的东西，想跟夜晚好好畅聊一番，毕竟好久没有吐露自己的心声了。啊，这感觉可真是太熟悉了啊。 回想起来，从小学到大学，记不清我有多少夜晚想些天马行空的事情睡不着，如果不记录下来还憋得慌。李江这小屁孩，就爱想些乱七八糟的东西，还非得抓住不放。 小学快毕业的时候，隔几天就在想同学们因升学的分别，或许一别就是终生不见，然后伤心个老半天。也时常想终有一天父母的衰老与离别，看着自己身体微妙的变化，不愿接受现实，却看到时光一点一点溜去。躺在床上看着窗外的月亮冷寂不语，偶尔想得多了也就会默默抽泣。妈妈发现了的时候，我便假装什么事都没发生。直到她摸了摸我湿润的枕头，我的心迹被暴露，这才忍不住哭出了声，痛快地抱着妈妈听着她的安慰，这才缓下神来。 上初中后变得更加坚强。那时候把什么东西都看得很重，重视身边的所有人，热爱身边的所有人。与人交往几乎都挺感性，不去想他是不是因为某些利益与你相交。生活中充满着爱和感动，除了对感情的执着坚守，多了许多对人生的思索，自我价值的定位和满满的社会责任感，也常常会记录一些身边励志的故事。想想人类为什么而存在，我们来一趟有什么意义呢？既然终有一死，不如多留给后人一些有意义的东西吧！可……人类有一天也会灭绝的啊，那你不是白来了吗？那就，留下点遗迹、建筑之类的，让之后的高等生物知道，这个世界上曾有我们体面地走过一遭，那就够了。同样，一个人死了，也能被许多后人记住和敬仰，知道历史上存在过这个人，那他就没有辜负这难得的一生。“你以后就要朝着这个目标努力，听见了吗，李江？”虽然现在觉得当时有些思想过度理想，还是或许我被现实渐渐磨平了棱角呢？ 上了高中，对青春对自由对梦想的感慨和向往成了思想的主流，也不乏对时间和不公的无奈和痛恨。上了高中，父母开始爱提因年纪增长而产生的变化，每每当着我的面提及，我都心如刀绞。我要迎接青春了，父母要告别青春了，高中，正是我接过沉甸甸的接力棒，勇敢向前迈的时候。知道这一天终于要来，心里有说不出的难受。高中开始不像初中那么听老师的话，反对应试，崇尚自由，脑洞大开。可能是被应试折磨得千疮百孔爱说气话，我渐渐认为，青春正当年，学习不是为了考试，学到真本事才值得提倡。我一点也不相信考试能检验出是否学到了真正应该学的东西，也极力反对几道高考题就这样把同班同学分成了三六九等。每个人的接受水平不尽相同，读书好不一定品质佳。读书只是我生命的一部分，考得再差，也不能阻止我对生活的热望。 尽管高三我的思想被压抑，在应试路上跌跌撞撞，支撑前行的只有责任和梦想，和终要过去又不想让它过去的时间。 夜晚，夜晚。我是你的老朋友了。好久不见，看来又到我找你谈心的时候了。我还是不是你当初认识的我呢？我应该是变了吧，不然怎么会看到以前的想法觉得陌生了呢。 不过熟悉的，还是跟你在半夜知心交谈的愉悦。","link":"/2016/05/22/那些与夜晚的交谈/"},{"title":"青铜器与殷商的毁灭","text":"@河森堡: 殷商覆灭后，周人总结商人亡国的教训，他们认为不可一世的殷商王朝之所以会土崩瓦解，其中一个重要原因在于商人饮酒无度，最终耽误了政事，今天我们再看这个结论，恐怕周人把问题想简单了。殷商的覆灭是多种因素共振造成的结果，但是其中一个容易被人忽视的原因在于青铜器本身具有一定的毒性。 青铜并不是单质，而是铜，锡，铅三种金属的合金，或许是因为锡资源的存量渐渐无法满足殷商铸造青铜器的需要，随着时间的推移，商朝青铜器中铅含量的比例越来越高，长沙市文物考古研究所的孙明老师发现，殷墟一期到殷墟四期的青铜器中，铅含量的比例猛烈上升，殷墟四期的某殷商高级武将的陪葬品中，青铜含铅量大多都超过了25%，以这种铅含量的青铜器盛放饮料或者食物，势必造成严重的铅中毒。 中国科技大学曾经做过青铜器的融铅实验，他们发现如果用青铜容器加热米酒，米酒中的铅含量会暴涨1200多倍。重金属铅在体内大量的富集会严重地伤害人的神经系统，今天一些学者相信，正是铅中毒，使得殷商像罗马那样，整个政权的高层都变得傻乎乎的，殷商后期一些贵族莫名其妙的荒诞行为，或许是重金属铅中毒的症状。而且铅在体内会以不溶性磷酸铅的形式聚集在骨骼中造成骨质疏松，商周贵族墓葬中墓主人的尸骨往往分解的很严重，而殉葬的人和牲畜反而保存的很好（殷商时，底层民众更多用陶器，而不是青铜），或许也可以用贵族摄入过量的铅来解释。 我始终相信的一点，那就是任何人类历史中的文化行为，无论是王朝更迭还是艺术创作，无论是礼仪祭祀还是娱乐宴饮，都有其自然科学的底层逻辑，自然科学可以照亮多远的未来，就可以照亮多远的过去。 参考文献： 秦亚, 秦颍, 刘文齐,等. 安徽何郢青铜时代遗址人骨铅含量分析[J]. 人类学学报, 2007, 26(3):284-288.孙明. 再论商王朝的衰亡与铅[J]. 华夏考古, 2016(1):75-81.","link":"/2017/08/30/青铜器与殷商的毁灭/"},{"title":"尊重死亡","text":"11999年，巴金先生病重入院。一番抢救后，终于保住生命。但鼻子里从此插上了胃管。“进食通过胃管，一天分6次打入胃里。”胃管至少两个月就得换一次，“长长的管子从鼻子里直通到胃，每次换管子时他都被呛得满脸通红。”长期插管，嘴合不拢，巴金下巴脱了臼。“只好把气管切开，用呼吸机维持呼吸。”巴金想放弃这种生不如死的治疗，可是他没有了选择的权利，因为家属和领导都不同意。“每一个爱他的人都希望他活下去。”哪怕是昏迷着，哪怕是靠呼吸机，但只要机器上显示还有心跳就好。就这样，巴金在病床上煎熬了整整六年。他说：“长寿是对我的折磨。” 2“不要再开刀了，开一个，死一个。”原上海瑞金医院院长、中国抗癌协会常务理事朱正纲，2015年起，开始四处去“拦刀”。他在不同学术场合央求医生们说，“不要轻易给晚期胃癌患者开刀。”现在中晚期胃癌患者一到医院，首选就是开刀，然后再进行化疗放疗。“就是先把大山（肿瘤主体）搬掉，再用化疗放疗把周围小土块清理掉。”这种治疗观念已深植于全国大小医院，“其实开刀不但没用，还会起反作用。晚期肿瘤扩散广，转移灶往往开不干净，结果在手术打击之下，肿瘤自带的免疫系统受到刺激，导致它们启动更强烈的反扑，所以晚期胃癌患者在术后几乎都活不过一年。”而现在欧美发达国家很多都采用“转化治疗”，“对晚期肿瘤患者一般不采取切除手术，而是尽量把病灶控制好，让其缩小或慢扩散。因为动手术不但会让患者死得更快，而且其余下日子都将在病床上度过，几乎没有任何生活质量可言。”所以，朱正纲现在更愿称自己是“肿瘤医生”，外科医生关注的是这次开刀漂不漂亮，肿瘤医生则关注患者到底活得好不好，“这有本质的区别。” 3美国是癌症治疗水平最高的国家，当美国医生自己面对癌症侵袭时，他们又是如何面对和选择的呢？2011年，美国南加州大学副教授穆尤睿，发表了一篇轰动美国的文章——《医生选择如何离开人间？和我们普通人不一样，但那才是我们应该选择的方式》。“几年前，我的导师查理，经手术探查证实患了胰腺癌。负责给他做手术的医生是美国顶级专家，但查理却丝毫不为之所动。他第二天就出院了，再没迈进医院一步。他用最少的药物和治疗来控制病情，然后将精力放在了享受最后的时光上，余下的日子过得非常快乐。”穆尤睿发现，其实不只是查理，很多美国医生遭遇绝症后都作出了这样的选择，“医生们不遗余力地挽救病人的生命，可是当医生自己身患绝症时，他们选择的不是最昂贵的药和最先进的手术，而是选择了最少的治疗。”他们在人生最后关头，集体选择了生活品质！“在奄奄一息的病人身上，被东开一刀，西开一刀，身上插满各种各样的管子后，被挂在维持生命的机器上……这是连惩罚恐怖分子时都不会采取的手段。我已经记不清有多少医生同事跟我说过：如果有一天我也变成这样，请你杀了我。”一个人失去意识后被送进急诊室，通常情况下家属会变得无所适从。当医生询问“是否采取抢救措施”时，家属们往往会立马说：“是。”于是患者的噩梦开始了。为了避免这种噩梦的发生，很多美国医生重病后会在脖上挂一个“不要抢救”的小牌，以提示自己在奄奄一息时不要被抢救，有的医生甚至把这句话纹在了身上。“这样‘被活着’，除了痛苦，毫无意义。” 4罗点点发起成立“临终不插管”俱乐部时，完全没想到它会变成自己后半生的事业。罗点点是开国大将罗瑞卿的女儿，有一次，她和一群医生朋友聚会时，谈起人生最后的路，大家一致认为：“要死得漂亮点儿，不那么难堪；不希望在ICU，赤条条的，插满管子，像台吞币机器一样，每天吞下几千元，最后‘工业化’地死去。”十几个老人便发起成立了“临终不插管”俱乐部。随后不久，罗点点在网上看到一份名为“五个愿望”的英文文件。“我要或不要什么医疗服务。”“我希望使用或不使用支持生命医疗系统。”“我希望别人怎么对待我。”“我想让我的家人朋友知道什么。”“我希望让谁帮助我。”这是一份叫作“生前预嘱”的美国法律文件，它允许人们在健康清醒时刻通过简单问答，自主决定自己临终时的所有事务，诸如要不要心脏复苏、要不要插气管等等。罗点点开始意识到：“把死亡的权利还给本人，是一件意义重大的事！”于是她携手陈毅元帅的儿子陈小鲁，创办了中国首个提倡“尊严死”的公益网站——选择与尊严。“所谓尊严死，就是指在治疗无望的情况下，放弃人工维持生命的手段，让患者自然有尊严地离开人世，最大限度地减轻病人的痛苦。”陈小鲁一直后悔没有帮父亲有尊严地离开。陈老帅病重到最后，已基本没有知觉。气管切开没法说话，全身插满了管子，就是靠呼吸机、打强心针来维持生命。“父亲心跳停止时，电击让他从床上弹起来，非常痛苦。”陈小鲁问：“能不能不抢救了？”医生说：“你说了算吗？你们敢吗？”当时，陈小鲁沉默了，他不敢作这个决定。“这成了我一辈子最后悔的事情。”开国上将张爱萍的夫人李又兰，了解罗点点和陈小鲁倡导的“尊严死”后，欣然填写了生前预嘱，申明放弃临终抢救：“今后如当我病情危及生命时，千万不要用生命支持疗法抢救，如插各种管子及心肺功能启动等，必要时可给予安眠、止痛，让我安详、自然、无痛苦走完人生的旅程。”2012年，李又兰病重入院，家属和医生谨遵其生前预嘱，没有进行过度地创伤性抢救，李又兰昏迷半日后飘然仙逝，身体完好而又神色安宁，家人伤痛之余也颇感欣慰。“李又兰阿姨是被生前预嘱帮到的第一人。”罗点点很感动。 5经济学人发布的《2015年度死亡质量指数》：英国位居全球第一，中国大陆排名第71。何谓死亡质量？就是指病患的最后生活质量。英国为什么会这么高呢？当面对不可逆转、药石无效的绝症时，英国医生一般建议和采取的是缓和治疗。何谓缓和治疗？“就是当一个人身患绝症，任何治疗都无法阻止这一过程时，便采取缓和疗法来减缓病痛症状，提升病人的心理和精神状态，让生命的最后一程走得完满有尊严。”缓和医疗有三条核心原则：1、承认死亡是一种正常过程；2、既不加速也不延后死亡；3、提供解除临终痛苦和不适的办法。英国建立了不少缓和医疗机构或病房，当患者所罹患的疾病已经无法治愈时，缓和医疗的人性化照顾被视为理所当然的基本人权。这时，医生除了“提供解除临终痛苦和不适症状的办法”外，还会向患者家属提出多项建议和要求：1、要多抽时间陪病人度过最后时刻。2、要让病人说出希望在什么地方离世。3、听病人谈人生，记录他们的音容笑貌。4、协助病人弥补人生的种种遗憾。5、帮他们回顾人生，肯定他们过去的成就。肝癌晚期老太太维多利亚问：“我可以去旅游吗？”医生亨利回答：“当然可以啊！”于是维多利亚便去了向往已久的地方。 6中国的死亡质量为什么这么低呢？一是治疗不足。“生病了缺钱就医，只有苦苦等死。”二是过度治疗。直到生命最后一刻仍在接受创伤性治疗。尤其是后者，最让人遭罪。北京军区总医院原肿瘤科主任刘端祺，从医40年至少经手了2000例死亡病例。“钱不要紧，你一定要把人救回来。”“哪怕有1%的希望，您也要用100%的努力。”每天，他都会遭遇这样的请求。他点着头，但心里却在感叹：“这样的抢救其实有什么意义呢！”在那些癌症病人的最后时刻，刘端祺经常听到各种抱怨：“我只有初中文化，现在才琢磨过来，原来这说明书上的有效率不是治愈率。为治病卖了房，现在还是住原来的房子，可房主不是我了，每月都给人家交房租……”还有病人说：“就像电视剧，每一集演完，都告诉我们，不要走开，下一集更精彩。但直到最后一集我们才知道，尽管主角很想活，但还是死了。”病人不但受尽了罪，还花了很多冤枉钱。数据显示，中国人一生75%的医疗费用，花在了最后的无效治疗上。有时，刘端祺会直接对癌症晚期病人说：“买张船票去全球旅行吧。”结果病人家属投诉他。没多久，病人卖了房来住院了。又没多久，病床换上新床单，人离世了。整个医院，刘端祺最不愿去的就是ICU，尽管那里陈设着最先进的设备。“在那里，我分不清‘那是人，还是实验动物’。”花那么多钱、受那么多罪，难道就是为了插满管子死在ICU病房吗？ 7穆尤睿做梦都没想到，自己的文章会在美国造成如此大的影响。这篇文章让许多美国人开始反思：“我该选择怎样的死亡方式？”美国人约翰逊看完这篇文章后，立即给守在岳母病床前的太太打电话：“现在才知道，对于临终者，最大的人道是避免不适当的过度治疗。不要再抢救了，让老人家安静离开吧！”太太最终同意了这个建议。第二天，老人安详地离开了人间。这件事，也让约翰逊自己深受启发：“我先把自己对待死亡的态度写下来。将来若是神智清楚，就算这是座右铭；如果神智不清了，就把这个算作遗嘱。”于是，约翰逊写下了三条“生前预嘱”：1、如果遇上绝症，生活品质远远高于延长生命。我更愿意用有限的日子，多陪陪亲人，多回忆往事，把想做但一直没做的事尽量做一些。2、遇到天灾人祸，而医生回天乏术时，不要再进行无谓的抢救。3、没有生病时，珍惜健康，珍惜亲情，多陪陪父母、妻子和孩子。随后，约翰逊拨通电话，向穆尤睿征求意见。穆尤睿回答：“这是最好的死亡处方。”当我们无可避免地走向死亡时，是像约翰逊一样追求死亡质量，还是用机器来维持毫无质量的植物状态？英国人大多选择了前者，中国人大多选择了后者。 8这是上海“丽莎大夫”讲述的一件普通事，之所以说普通，是因为这样的事每天都在各大医院发生——一个80岁老人，因为脑出血入院。家属说：“不论如何，一定要让他活着！”4个钟头的全力抢救后，他活了下来。不过气管被切开，喉部被打了个洞，那里有一根粗长的管子连向呼吸机。偶尔，他清醒过来，痛苦地睁开眼。这时候，他的家属就会格外激动，拉着我的手说：“谢谢你们拯救了他。”家人轮流昼夜陪护他，目不转睛地盯着监护仪上的数字，每看到一点变化，就会立即跑来找我。后来，他肿了起来，头部像是吹大的气球，更糟糕的是，他的气道出血不止，这使他需要更加频繁地清理气道。每次抽吸时，护士用一根长管伸进他的鼻腔。只见血块和血性分泌物被吸出来。这个过程很痛苦，只见他皱着眉，拼命地想躲开伸进去的管子。每当这时，他孙女总低着头，不敢去看。可每天反复地清理，却还能抽吸出很多。我问家属：“拖下去还是放弃？”而他们，仍表示要坚持到底。孙女说：“他死了，我就没有爷爷了。”治疗越来越无奈，他清醒的时间更短了。而仅剩的清醒时间，也被抽吸、扎针无情地占据。他的死期将至，我心里如白纸黑字般明晰。便对他孙女说：“你在床头放点薰衣草吧。”她连声说：“好。我们不懂，听你的。”第二天查房，只觉芳香扑鼻。他的枕边，躺着一大束薰衣草。他静静地躺着，神情柔和了许多。十天后，他死了。他死的时候，肤色变成了半透明，针眼、插管遍布全身。面部水肿，已经不见原来模样。我问自己：如果他能表达，他愿意要这十天吗？这十天里，他没有享受任何生命的权力，生命的意义何在？让一个人这样多活十天，就证明我们很爱很爱他吗？我们的爱，就这样肤浅吗？ 92005年，80出头的学者齐邦媛，离开老屋住进了“养生村”，在那里完成了记述家族历史的《巨流河》。《巨流河》出版后好评如潮，获得多个奖项。但时光无法阻止老去的齐邦媛，她感觉“疲惫已淹至胸口”。一天，作家简媜去看望齐邦媛。两个人的对话，渐渐谈到死亡。“我希望我死去时，是个读书人的样子。”最后一刻仍然书卷在手，最后一刻仍有“腹有诗书气自华”的优雅，最后一刻眉宇间仍然保持一片清朗洁净，以“读书人的样子”死去，这是齐邦媛对自己的期许。你呢？如果你是绝症患者，当死亡不可避免地来临时，你期待以什么样的方式告别人世？如果你是绝症患者家属，你期待家人以什么样的方式告别人世？不久前，浙江大学医学院博士陈作兵，得知父亲身患恶性肿瘤晚期后，没有选择让父亲在医院进行放疗化疗，而是决定让父亲安享最后的人生——和亲友告别，回到出生、长大的地方，和做豆腐的、种地的乡亲聊天。他度过了最后一个幸福的春节，吃了最后一次团圆饭，7菜1汤。他给孩子们包的红包从50元变成了200元，还拍了一张又一张笑得像老菊花的全家福。…………最后，父亲带着安详的微笑走了。父亲走了，陈作兵手机却被打爆了，“很多人指责和谩骂我不孝。”面对谩骂、质疑，陈作兵说：“如果时光重来，我还会这么做。” 尼采说：“不尊重死亡的人，不懂得敬畏生命。——《转载自知乎》","link":"/2017/06/30/尊重死亡/"},{"title":"社会趋势之于个体成功","text":"作者：陈宇（江南愤青），仁和智本资产管理合伙人 来源：风吹江南（ID：jrjnfq） 我自己一直在反思这些年里的很多事情，突然发现所有的成功失败，很大程度上都不是我自己个人能力决定的，而是很大程度上被大趋势给决定了。 我很多年前写了篇中国股市的文章，里面提到我自己为什么离开股市，突然只是因为觉得我这个人能力不如别人，勤奋不如别人，运气不如别人，我凭什么跟人在一个能力充分竞争的市场上赚钱？ 我唯一盈利性的机会其实只有一个，就是猪都会赚钱的时候，我才有赚钱的机会啊。也就是风口来的时候，例如06年，例如09年，那时候，满大街都会听到谁赚了多少，谁赚了多少，于是我就能有机会赚钱了。 如果在一个不是普遍性的盈利市场上的时候，我发现赚钱一般都是辛苦钱，也就是跟人比体力才能赚钱，花更多的时间，做更多的调研，那些都是辛苦钱。而可悲的可能是竞争越充分的市场，你会更可悲地发现你即使很辛苦了，也是不赚钱的。 后来衍生出去看很多问题，发现其实不单是股市，任何行业好像都是差不多，2002年的时候，我们很多同学离开了中国去美国读书，都是名校啊，牛逼的一塌糊涂的名校啊，我们这些“垃圾”被留在国内，十多年过去了，我们这些“垃圾”在国内啥事情也没干，结婚生子，然后没事只能买房子，一套两套三四套，然后就发现那些国外读了n年书的同学们可能就比较悲催了，回国可能一套房子也买不起。 是我们能力强么，不是的，是因为我们赶上了好时候，中国大发展的格局里，能力其实不是最重要的，我们自己也很悲催地发现，回老家去，甚至不如那些没考上大学的同学们，他们初中毕业、高中毕业就开始闯荡江湖，更早地接触社会，更早地在外贸领域做业务，而你因为可能是大学毕业，选择也比较多，反倒不如他们有更好的积累，尤其在过去十年赚钱最多的房地产行业，一般比拼的其实也是胆魄而非能力。 我们东阳是建筑之乡，很多人很小就跟着走南闯北做工程，然后在过去十年里，一个个都赚了很多钱，反观我们自诩名校毕业，其实是不如他们的，当然现在趋势也在变化，互联网出现的格局里，房地产衰退之下，这个趋势不同了，盈利逻辑也跟着变化了。 我前些日子碰到一个ut出来创业的小伙子，当年ut 可能在全国招聘的为数不多的本科生，他打败了无数的人终于挤进了ut，而那些被他打败的人，黯然地走进了阿里的大门。 彼时的阿里容纳了一帮乌合之众，很多都是职业技术学校毕业的学生，名校几乎没有，十多年过去了，那个进了ut的天才，现在要出来创业了，那些没办法只能去阿里的人，一个个身价过亿要给那些牛逼哄哄当年逼得他们无路可走的牛人们投钱去了，能力决定一切么？好像还真不是。 马云前些日子，跟黄晓捷师兄（九鼎投资创始人）谈话，他谈到他2001年在五道口读书的时候逃课去卖空调，希望发家致富，结果卖了一年多，晒得黑黑的回学校，然后说了一句话，叫辛苦不赚钱。 跟我所思考的几乎是一致的，这简直就是句真理，这个世界上，赚钱的事情，从来不是辛苦的事情。 你们比辛苦，比的过那些富士康的工人么，比得过农民伯伯么？但是他们比你更赚钱么？所以世界上，如果一个行业要靠比能力来赚钱的时候，你会发现好像赚的只能是辛苦钱了。更苦逼的是甚至很多人还赚不了辛苦钱，例如现在一堆苦逼的淘宝电商。 现在创业的人很多，我一直都跟大家说，创业有时候选择大方向很重要，因为赚大钱和赚小钱说白了，其实都会很辛苦，都很艰难，你路边开一个小店铺要做成赚钱，其实也不见得比做好一个国有企业容易到哪里去，都不容易，但是同样辛苦，结果是截然不同的。 这个时候，大格局大趋势就显得非常重要，尽量去做一些趋势性的机会的事情，市场整体向上的机会，只要做的稍微好点，总还是有机会的，而有些行业，你再怎么做，其实都注定了最终的结果都不会好。 我们做投资的要去投资一个赚的是辛苦钱的时候，那就会发现我们赚取的只能是社会平均回报率，于是我们到最后发现得出的结论其实也还是尽量淡化能力的重要性，更多看中趋势性的投资机会，在大趋势性的格局里，在进行一定程度的铺量投资，能力无法量化，很难确切的预测，而大趋势的视野还是有一定的逻辑可循。 周鸿祎说：有一个竞争对手永远打不败，那就是趋势。 孙中山很多年前有句话叫“天下大势，浩浩荡荡，顺之则昌，逆之则亡”，意思就是任由你再牛逼，你也无法对抗历史的潮流，这就是趋势的力量。但是问题来了，趋势到底是什么呢？ 孙中山趋势这个东西，有几个特征挺有意思： 第一个特征其实是趋势只有在将起未起的时候，才有意义，太早看到趋势其实毫无意义，太晚你会错过太多的东西。 也是为什么很多聪明人都赚不到钱的原因，趋势看到了最后就是虚无主义者，因为觉得这个也就这样那个也就那样，都没啥意思，看得太远的人，其实挺适合做先知，当然也很容易成为先烈，看得太早的悲催案例太多了，意义更是不大。 哥白尼在中世纪就看到了地球不是宇宙中心，于是就被火烧死了，太多太多聪明人死在了不在当下生活的故事里去，等好不容易撑到风口来的时候，他已经先没了。 而如果趋势都被人看到的时候，其实趋势的意义也就没了，当真理都被大家接受的时候，真理就会沦落为常识，你已经没有任何机会和优势来成为一个布道者了。 在现实中也有挺多好玩的事情。前些日子听到一个农民说： 政府让我们种葱，我们就种蒜；政府让我们种蒜，我们就种葱。 这个就是极为简单朴素的趋势性发现的案例。 当趋势被所有人都看到的时候，你其实只能回归到赚辛苦钱的逻辑里去，记住辛苦钱往往不赚钱的真理吧。 在这个特征里，我们收获的东西是什么呢？是提前预判很重要，因为只有在人们尚未发现，而你却提前发现，也提前动手了，那你或许能有先发性优势。 这里挺有意思的是很多人其实都能看到一些趋势性机会，但是能下手的人其实也不多，看多做空，看空做多，甚至看而不做的人，其实都挺多。我们经常听很多人说，当年我怎么怎么看对了，但是这种看对了，跟你有啥关系么，总体来说，爱折腾的人，胜算更大，未来的创业很大程度上会比拼试错的次数和成本的综合。尤其是趋势留的时间窗口越来越小的时候。 我自己对金融行业的简单理解就是金融很大程度上是看天吃饭的行业，在普遍性不赚钱的市场里，你金融机构要实现盈利，难度其实很大，这种典型看天吃饭的行业的合理逻辑就是能赚钱的时候，狠狠地赚钱，不能赚钱的时候就回家休息，游山玩水。 不跟大趋势做对抗，当然不是说大趋势不好，你没有赚钱的机会，只是这种机会会很辛苦，好汉不赚六月钱？火中取栗的事情玩他干什么呢？ 三国当年袁绍官渡之战，谋士跟他说，不能打，不能打，一定败。 袁绍不听非要打，还把谋士关了起来，后来果然败了。别人就跟谋士说，主公败了，真该听你的话啊，回来会感激你的。 谋士就叹气说，不是的，如果主公胜了，一定会很高兴，然后天天奚落我，骂我神棍，我还能活命；如果败了，他一定会觉得面子挂不住，反倒把我给杀了。 没多久就应验了，这个世界没人喜欢说真话，的确是有道理的。不过好在我是自由身，这个也是互联网带来的好处，就是你喜欢听就听，不喜欢听就不听。 今年创业市场非常火热，大量的vc成立，是个人都成为了投资人，都希望投资出一个阿里巴巴、腾讯、百度等等，一边是实体的不景气，一边是创业氛围的浓厚，形成了鲜明的对比，两个逻辑其实是相通的，实体越不好，资金就越挤入具备想象力的行业中。 我们在回到趋势这个话题里去，趋势的背后其实反应很多问题，现在很多人都在说阿里如何牛逼，如何牛逼，其实这个话题怎么说呢？ 在一个趋势起来的时候，乘风而起其实难度并不如想象中大，在新兴领域并不需要太大努力，就能较为轻松地击败固有规则体系里的王者。 苏宁曾经是线下的王者，当年股价也是极其牛逼的，但是阿里打掉苏宁，我并不愿意认为是一个企业对一个企业的胜利，它是一个时代对另外一个时代的胜利。每个时代里都有自己的王者，苏宁代表了互联网未出现之前的渠道之王，而阿里则是互联网时代的王者，本质反应的其实是人类走入了互联网时代，原先的那种生活方式对苏宁的依赖变得不再被需要。 这个时候，你会发现不是苏宁不努力，不牛逼，而是再牛逼也没用，你是很好很好的，只是我也不需要了，这个是挺悲伤的爱情故事。 事实上这种趋势性的颠覆市场上有过太多的案例，很多曾经在我们生命中如此重要且认为永远都不会离开你的东西，其实发现一点点都在离去，这个观点其实用在阿里、腾讯身上也一样适用，你认为永远离不开的它们，也说不定很快会离去。 这个就是可怕的趋势之争，不同维度体系里的竞争是极其可怕的，压根不是单纯和纯粹的能力之争了。互联网其实是个底层革命，改变很多的生产作业方式，从而使得固有生产作业方式上的一系列王者的优势丧失。 因为互联网这个技术，我们被改变了很多，在很多行业都日益被互联网的今天，金融业不可避免受到波及，但是事实上金融业由于是低频交易，它所受到的波及并不如对其他行业影响的大，但是又由于金融业的客单价高，这种变革带来的影响力却很大。 趋势的第二个特征是什么？ 是随机偶然不可测。 我们看到很多是因为技术的不可替代性，群体性特征的不可测性。使得技术是不可琢磨的，而且群体性特征的兴起使得热点不断被改变，社会整体的无意识，你很难把握未来趋势的机会在哪里。 我自己观察和发现，世界上能跟着趋势赚钱的是两类人： 一类人是马云、黄晓捷这样的人，他们天生具备敏锐的嗅觉，对于市场的理解很通透，而且执行力很强，天生爱折腾，且够狠，对自己能狠下心来的人，都能成点事情，如果看准了方向，能成大事。 还有一类人压根不存在所谓选择一说，他们中绝大多数人所谓跟着趋势赚钱，并不是主动意识的结果，而是被动选择的结果，他们被社会的洪流抛向了不同的领域，然后就是花落谁家是谁家的格局，有人成事，有人败事，无非是祖坟冒青烟的结果罢了。 94年被下岗的人，后来都能赚点小钱，而那些不下岗的员工，现在估计得下岗了，02年进不了银行的人，去了房地产或者去了阿里，现在赚了大钱。在过去的十多年里面，我们这个逻辑和趋势很明显，决定你是否赚大钱的逻辑，不是选择，不是能力，而是运气，对，就是运气。 我一直跟很多人说这个世界，你赚小钱才是能力，赚大钱其实是靠命的，你努力勤奋，现在的社会，让你能过比较好的生活，但是，并不是努力勤奋就能让你成为马云马化腾的，命格不在，就别瞎想了。 其实我在台湾大学做演讲的时候提过一个叫中美教育比较的观点，我们发现美国赚大钱的人都是名校毕业，至少考上了名校，美国要上名校，也是不容易的，都是牛人，但是中国其实赚大钱的很少是名校毕业的，首富也只是杭州师范大学而已，不是说这个学校不好，至少没有清华北大好，这个大家总是要认的吧。 那么这里说明的问题是什么呢？ 是因为大爆发的年代里，越是底层越容易被抛向不一样的社会洪流，而不一样的洪流，往往会有大机遇，很多人没得选择，更不会走固有的社会路径，也就更容易被抛弃社会的大趋势之中去。 我们过去十年的趋势性机会，不是互联网，互联网其实是最近一两年的趋势，过去十年的趋势性机会其实是资产升值，大量的房地产商在过去十年的盈利能力其实是极强的。 只是趋势一旦逆转以后，互联网很轻松地就击垮了这个固有的社会趋势，不是房地产不行，也不是互联网太牛逼，而是社会趋势转化很快。 在过去房地产是趋势的格局下，你会发现，我们曾经很多年的首富五十强，都是房地产老板，还有曾经的煤老板，他们的出身都极低，为什么呢？ 很多人其实到现在也没弄明白他们是怎么赚这个钱的，很多人都会把自己的成功归结为能力的结果，事实上这个是最大的可悲，哪里有什么能力的结果呢？ 你刚好在适合的年代碰巧做对了一件事情而已，然后就长期坚持这种策略，坚持固有的逻辑去做事情的话，结果可能会死得很惨。","link":"/2018/06/14/社会趋势之于个体成功/"},{"title":"爸爸妈妈的年青时代","text":"我以前常常骄傲于找出我的年代与父母的不同之处，好像要向他们展示祖国新花朵生活环境的缤纷与灿烂。但是才慢慢发觉，爸爸妈妈的生活同样美丽，与父母拥有青春时期的共鸣点是何其幸福的事情。随着年龄的增长，两代人同样是在向青春致敬，因为青春这个东西，我与爸爸妈妈的心越来越近。回味着胶卷时代的相片，以及参阅种种时代的见证，我在爸爸妈妈的讲述中走进那个熟悉人物的别样时代。 爸爸妈妈的成长外公外婆在江西某核工业基地工作，于是妈妈一家人都在深山里面工作和生活。没有城市的喧嚣纷扰，他们却获得了一种逍遥自在的生活方式。坐在外公的汽车里，穿越原始的山林，几个激动的孩子左顾右盼，清新撩人的山风扑面，听水声潺潺看树影环抱。调皮的他们有时候偷吃当地老表的作物，有时候出来摘摘甘甜的野果，脚趟湍急的山溪，穿越长长的吊桥。妈妈和舅姨们说到这里总是心潮澎湃，对这种自然野性的生活念念不忘，常跟我说要带我回去好好体验一番，虽然当下已冷清荒凉。 妈妈有时候也会童性大发，把小小的头伸进铁门间，穿过来，穿过去，怡然自乐。不料，有一次当她把头伸进较窄的栏间时，头却被卡住了。她既害怕又着急，不知所措的她看到旁边菜地有个男的捧腹大笑她的窘样，尴尬之余更多生气。几经挣扎，忽地一下就把头抽了出来，对他做了个鬼脸，跑走了。 妈妈说她最怕的就是山里的蛇。小时候，妈妈会独自山上捡柴火，有一次天快黑了，于是就背着柴火加快脚步往回跑。跑着跑着，树上的一条蛇倏然掉到她的脖子上，妈妈瞬间感觉脖子一阵冰凉，那股凉气瞬间在她体内扩散开来。她吓得没有动弹，屏住呼吸，眼睁睁地看着蛇在她身上冷峻地爬来，再从她的身上爬走。 孩子们很懂事，家里很少能吃上鸡蛋，外婆用家里难得吃一次的酒酿蛋招待客人的时候，小小的他们在一旁直流口水但却没有吵着要吃；在弟弟受人欺负的时候，姐姐们义愤填膺合伙找他算账；在外婆生病的时候，妈妈与大姨上山砍柴照顾小姨和舅舅……学业根本不是他们所担心顾虑的事情，在醇美的大山里养成了天真纯朴的美丽性格。 爸爸就没那么幸运能待在国营企业，爷爷奶奶是标准的湖南农民。从小家里很苦，奶奶的身体又不好。爸爸每天上学都要早早起来自己做饭，越过几个山头到赤马镇里读书，回到家又得牵着牛跑。于是在我和爸爸都同时偷懒的时候，爸爸总爱对我说：“像你这么大的时候我每天放完学就去放牛。”他们几个兄弟都陆续地上学，人人都盼望着有一日能改变单调的生活，盼望着能过上幸福的日子。爸爸在长沙市里度过了它的大学时光，常常在城市与农村之间奔走，有时会住在对他关怀备至的亲戚家里，一点一滴的感动坚定他追求理想的信念。在长沙的时候，没有亲人，只好独自享受属于自己的孤单与寂寞。他还尝试过在路边卖衣服，凝望着人群熙攘，探寻着将来未知而莫测的路。我能想象出小小的他在为生计奔波的样子。爸爸的求学路确实很艰辛，不仅是在物质上的匮乏，更是精神上的历练。 南下，南下1993年，爸爸妈妈顺着改革开放的洪流一路南下，聚在了神秘而陌生的深圳。那时候的深圳，既不是邓主席刚刚画过圈的宁谧寂静的小渔村，也不是现在的繁华国际大都市，而更是像在浇淋暴风雨中的笋林。如果说深圳是浴火的凤凰，那么那时正是人们燃烧自己的时候。 爸爸与另一个同学扛着塑料条编织的经典行囊，带着自己积攒的有限的现金从火车站出来，来到改革开放的风口浪尖，随即开始了迷茫寻找工作的历程。一天天过去，在人才市场的闯荡与尝试考验着他们的耐力与精神。内心的无助在几天下来腰包已经干瘪、工作没有着落的情况下变得无限放大。就在他们最最绝望的时候，爸爸被南山一家台商办的公司招为电子工程师，飘摇的小船终于得到平静。 妈妈的来深道路则简单很多，国营单位将老员工的待就业子女被车拉到了深圳，分配到了同样的那家公司。初来乍到，从干粗活到流水线，在国营单位父母陪伴、大山里新鲜空气下长大的孩子第一次离开父母。她们辛勤工作，盼着有一天能够光荣地拿着挣来的钱回到家里见父母，告诉他们：你们的孩子长大了，在外头打拼挣钱了。当每年年底快过节的时候，单位派车来接她们回去。车声传入她们的耳畔，她们老远看到车来了，就纷纷冲下楼，泪眼汪汪地准备回家；家里的人早已做好饭，在马路上迎接着汽车的归来，游子们含泪下车之时总会受到家里人温情的拥抱。 为爱痴狂妈妈在不断努力工作后被安排到流水线当主管，爸爸也在品管部当经理。女方美丽的容颜以及严谨细致的工作态度深深将男方吸引，血液中迸发出追求爱情的灵魂，他们的爱情故事由此展开。说到这里，身为孩子的我总是感到特别别扭，如果我穿越到那个时间，看到年轻的爸爸妈妈坐在一起，以接近他们年龄的面孔告诉他们我是你们的未来的孩子，他们会有什么想法呢？ 妈妈说很多男生都追求过她，但是傻傻的她仍然选择了傻傻的爸爸。为了得到这份真挚的爱情，爸爸有时候会做出现在我无法想象的事情。比如在别的男同志欺负她的时候，他会勇敢地站出来，拿刀相向。 听到这里我才知道原来爸爸妈妈的爱情有这么坚固诺言和不可阻遏的火花，对于孩子来说，父母之间有如此坚毅赤诚的感情是如此惬意！ 爱情的力量使得他们最终走在一起，妈妈带着一起下海的大姨跟着爸爸回到了湖南爷爷家。因为爸爸是爷爷家第一个南下打拼的孩子，妈妈也就成为爷爷家附近第一个远方来的媳妇。大家看着这位从外地来的媳妇，红色的婚礼红色的衣，红色的嘴唇红色的情，他们成为婚礼宴席的主角，在土房子里许下终身的诺言。 回到深圳，不久，爸爸妈妈就从宿舍搬走，在公司附近租了间小房子。在人人都为生计奋斗的时代，他们共同吃一碗饭，两个人面对面额对额吃着不多的米饭。亲密无间的爱情在属于他们的时代背景下就这么简单浪漫地荡漾，像宁静的夜晚广阔的大海上温暖的亮着渔火的船，视角再远再远仍然能看得清楚那盏橘黄的灯，时空再遥远仍然能感受到那么明亮柔情的光芒。 他们一点一点积攒着钱，把自己赚的血汗钱分成几份，一份给爷爷家、一份给外公家、一份留给他们、一份留给未来的我。 痛苦中诞生希望爸爸妈妈95年结婚后，攒了几万块才真正有充足的经济能够在98年生了我。他们在深圳认识，但为了让我有根的感觉，就一起回到了爸爸的老家浏阳。妈妈尽管对浏阳的很多东西不适应，语言和饮食都不通，再加上身处异地思念亲人，但最终还是克服了这些挫折。原本不吃辣椒的妈妈也渐渐地接受了它，现在倒成为一个辣椒达人。 怀孕的那段时间，妈妈从一个在大山里玩惯的孩子走向苦闷枯乏顶着大肚子的母亲。半年多不能看电视，害怕有辐射会影响胎儿，只能听着收音机里无言的音乐；寒冬时期，当外头冰霜覆盖的时候，妈妈冷到发抖却不能烤火，只能窝在被子里忍受寒冷与寂寞。 听妈妈说，在我出生的那一天，湖南下着扑面的大雪。两个伯伯用简易的轿子抬着疼痛不已的妈妈从遥远的爷爷家抬到镇上，我在那里的卫生院被接生了出来。 可是不那么幸运，妈妈出现了严重的产后不良症状。 妈妈在生我之后无法正常排尿，只能通过插管子来定时释放。镇里的医生一见到这种情况，二话不说把妈妈的点滴拔掉，要求我们转院。爸爸在镇里临时租了个面包车，心急如焚地将妈妈送到了另一个镇上，那里的医生勇敢地处理了几天，没想到病情加剧。没有办法，我们只能坐车到浏阳市去看病。妈妈被送到了浏阳市的一家医院。 我看着转院浏阳的病历观察本，几页的本子被医生的钢笔字迹填满。每一字每一句都深刻地描述着妈妈当时躺在病床上痛苦的经历。我从来没有看过哪个医生把病历本写得这么认真、这么掷地有声，在妈妈刚生我之后的病历本这里，我算是开了眼界。妈妈痛苦的时候，曾经绝望地向爸爸说：“我从房子上跳下去好不好。” 很感激医生把妈妈的病状一五一十地描绘出来，让我能够感觉得到好像现在的我就在那里，就在妈妈身旁陪着她，陪着她一起反抗病魔，在她身边一边内疚于我的诞生。 我看着病历本上记录的日期逐渐推移，看到妈妈的症状正不断好转，看到医生笔下满满病历上最后两个字写着出院，我的心如沉石一般落下。这是我看过的最惊心动魄的故事情节。 从那时起，我便正式地被这个世界邀请进来。作为爸爸妈妈对未来的希望，小小的我身当重任却毫无察觉，新奇地观察着这个世界的每一个角落，感觉这个世界就是我的游乐场。 不平静的社会在被子里裹着，装在一个箱子里，插在拥挤的人群中，放在轰隆轰隆的火车上，人们看着我说：“这么小的小孩就跟着南下了哈。” 坐了许多年的火车，以至于我现在听到火车跨过无数铁轨的声音都感到无比亲切。 当时的深圳还不能说是改革开放带来新世界，仅凭比内地多一些高楼大厦是说明不了什么的。在爸爸妈妈口中，那是一个令人胆战心惊的时代。每天深夜都会有警车的蜂鸣声无止息地刺耳，派出所日夜不息地巡查所谓的三无人员，在马路上必须要带上证明自己的身份证件，如果没有就会被抓到派出所拘留。那时候红树林是被警察重点监控的，人迹罕至，也就多鱼蟹。妈妈有一位同事因好玩而去红树林抓螃蟹，没有带身份证件而被警察抓走，听说她在拘留地忍受了无法忍耐的酷刑，睡在厕所里，不停地搞卫生，有人来的时候还饱受凌辱。几个星期后被公司花钱保释出来，她后悔地说：“我这辈子再也不冒险了。” 不仅是警察的乱，还有恶势力的猖獗。妈妈有一对同事情侣，他们深夜在住宅区附近的小河旁约会。黑幕中，几个高大的歹徒拿刀直指双方，歹徒对男方恐吓道：“要钱还是要女友？”，男的吓得瑟瑟发抖，把身上所有的钱都交了出来，不料，歹徒接过钱之后没有放走女友，反而将她拐走。几个月后，那个女的回到公司，衣服破败不堪，什么话也没说，收拾完行李就直接走了。 老舅来深圳的时候，在市内找了很多工作，也被骗了不少。有一次，他来到地王大厦旁边的一幢金色的大厦里，准备投简历。前台的人让他交四百块钱的介绍费，他只交了身上仅有的两百。他在一旁等待的时候，旁边的一位老伯告诫他：“你还是不要等了，快走吧。” 这时候老舅才感到一阵不妙，想向前台要回他的两百块钱。这时候他发现前台的墙壁是可以活动的，而且有人在里面，于是就赶紧走，也放弃了要回两百块钱的念头。还有一次，在另一个地方投简历的时候，直接被公司的车拉走，拉到关外拔草，干了一个上午才被放走。 对比十多年后的深圳，这些无理由的人权的侵犯简直是不可理喻。我曾经还觉得在八九十年代生活比现在轻松自由得多，没想到每个年代都有每个年代的血与泪。 我的梦幻童年我在家人的呵护下渐渐长大，每每回想起小时候经历的事情总是那么如梦似幻。很小的时候还住在南山，家人常常带着我去华侨城那一带玩耍，对于我来说，华侨城简直是美丽到了极点的地方。在华侨城呆过的每一帧记忆都是那么令人心驰神往。 首先要提到的就是世界之窗和锦绣中华那一段，作为深圳的标志之一，那一块的风景在我看来特别的高贵而圣洁。每天晚上，世界之窗广场的喷泉下总会亮着绿色的亮光，光线把一整串的水柱照得透亮，喷泉的水像会流动的晶莹的绿宝石。我常常跑上喷泉旁去看美丽的灯光，绿色的灯光隔着水幕照样亮得刺眼，使我既不情愿又非常舒服地闭上眼睛。在白天的时候，广场上还有许许多多的胖鸽子，我一见到它们成堆地在一起吃东西，便会开心地冲向它们，看它们迟钝的样子吃还没吃饱就被我赶飞的窘态。在阳光下跟着鸽子一起奔跑。 以前的被子用久了就会有棉粒。小的时候，我一直傻傻地坚信，只要把被子上的棉粒投进世界之窗广场的喷泉里面，它就会产生爆炸一样的水花。好不容易有几次机会来世界之窗，可惜总是忘记从家里的被子上取下棉粒。我想，这应该是我小时候最大的心结了吧。我等了好久好久，那一次我又跟家人来到了世界之窗，依旧忘带被子上的棉粒。无奈，敲破脑袋想办法，赶紧在衣服裤子上拔下几粒出来，用尽全力向喷泉里扔，可是棉粒轻轻的却总是被喷泉的水汽弹回。 不得不提的是华侨城那一段的景色。好像进入梦境一般，被繁密的树荫包裹住的人行道上，依稀能见到阳光的剪影，偶尔能听见鸟雀的吟叫，妈妈牵着我的手，顺着青葱寂静的人行道，走向天空中的游乐场。一点也不夸张，那里的景色依旧是这么令人陶醉，在我脑海里回荡十余年不改本色。所谓“天空中”，其实是游乐场建在一幢房顶天台上。那幢大楼有一扇很大的玻璃门，走进去，可以看到盘旋上升的旋转楼梯。下面几层好像是一户保龄球馆，但是我从来没有进去过，我关注的是顶层阳光下的游乐场。 不知道谁有这么圣洁的创意，把游乐场设在房子的最顶层。从那个游乐场向下俯瞰，能看到整个世界之窗以及深南大道的美景。我想，这应该是大人们前所未有的对儿童的尊敬。我在游乐设施间陶醉的时候，妈妈便坐在远处的木椅上看着我笑。 搬迁关外因为爸爸的公司迁出特区，我们家也跟着一起来到了宝安。我们住在西乡密集街巷里的一个庭院中，开了一个小厂，我也住在里面。我很怀念住在南山的日子，每年都在数着我生命中留在南山的时间与留在宝安的时间，等到我呆在宝安的时间超过了南山的时候，我才慢慢意识到我成为了一个宝安人。 那时候妈妈每天工作下班便走几公里从幼儿园接我回家。要回到我们家，得先穿过嘈杂喧闹的街市，经过栉次邻比的水泥房。妈妈牵着我的手，在路上时不时能看见改建的楼房和日夜不息的水泥搅拌车，妈妈不厌其烦地跟我说少闻些水泥味，天真的我却觉得挺香的，一边笑一边大口大口做着吸气状惹妈妈开心，一笑就笑到日暮黄昏。 我深深记得，妈妈刚强地抱着我穿过了附近新铺水泥的马路；记得她用大大的手护住我的头，带我穿过建筑护网包围的危险地段；记得我们为了不闻臭味而摒息向着前方奋力地向前冲刺；记得在我眼睛掉进沙子后妈妈一边吹着我的眼睛一边念着神奇的咒语：“小石头，吃沙子，吃得进，吃掉去，吃不进，吐出来，咕噜咕噜噜……” 有一次宝安内涝，家里的庭院积了挺深的积水，积水深达一个成年人膝盖的高度。但是我很激动。我依稀记得爸爸告诫我不要自己下水走路，小心地面上看不见的松动的井盖。爸爸背着我穿过被雨浸过的灰色的水巷，肩膀不大但很硬朗，身材消瘦但不失气力，身上的味道有他的特征。我在他的背后可以无所畏惧恣意玩耍。怕什么料峭风雨，爸爸的肩膀也轻胜马。 渐渐地我上了小学，每天放学都能看到妈妈的身影。手里拿个牛肉串，我不断让妈妈讲故事，或者不停地问她为什么。跟她一起分享小学学到的一些小知识，一起学习入门英语，向妈妈炫耀两位数乘十一的快速运算，又或者是讲述一天中发生的事情。妈妈与我无话不说，没有秘密，我们像对方的一面镜子，在微笑的时候不忧愁、悲伤的时候不喜悦。 之后，我们家在新安买了房子，住在一个将来近乎十年呆的处所里。当我逐渐发现妈妈讲的故事开始重复，或者编得不符合逻辑的时候，我便开始了创造我自己年青时代的努力。","link":"/2014/07/28/爸爸妈妈的年青时代/"}],"tags":[{"name":"Life","slug":"Life","link":"/tags/Life/"},{"name":"Distributed computation","slug":"Distributed-computation","link":"/tags/Distributed-computation/"},{"name":"Data Analysis","slug":"Data-Analysis","link":"/tags/Data-Analysis/"},{"name":"Politics","slug":"Politics","link":"/tags/Politics/"},{"name":"Nature","slug":"Nature","link":"/tags/Nature/"},{"name":"Times","slug":"Times","link":"/tags/Times/"},{"name":"Thought","slug":"Thought","link":"/tags/Thought/"},{"name":"Travel","slug":"Travel","link":"/tags/Travel/"},{"name":"History","slug":"History","link":"/tags/History/"},{"name":"Society","slug":"Society","link":"/tags/Society/"}],"categories":[{"name":"Qzone","slug":"Qzone","link":"/categories/Qzone/"},{"name":"Data Science","slug":"Data-Science","link":"/categories/Data-Science/"},{"name":"Essay","slug":"Essay","link":"/categories/Essay/"},{"name":"Excerpt","slug":"Excerpt","link":"/categories/Excerpt/"}]}